/**
 * ============================================================================
 * 准备DOM
 * ============================================================================
 */

/**
 * ====================================
 * 处理现有DOM
 * ====================================
 */

/**
 * 设置访问模式。
 */
function setAccessMode() {
    if (window.isBlogOwner) {
        console.debug("访问模式：主人");
        document.body.classList.add("x-mode-owner");
    } else {
        console.debug("访问模式：访客");
        document.body.classList.add("x-mode-visitor");
    }
}

setAccessMode();

/**
 * ====================================
 * 创建新DOM结构
 * ====================================
 */
